package net.univr.pushi.jxatmosphere.utils;

import com.google.gson.JsonArray;
import com.google.gson.JsonElement;
import com.google.gson.JsonObject;
import com.google.gson.JsonParser;

/**
 * author : Administrator wl
 * e-mail : 389456264@qq.com
 * time   : 2018/06/27
 * desc   :
 * version: 1.0
 */


public class YujinWeiZhi {
    public static String info = " [\n" +
            "  {\n" +
            "  \"id\":\"57598\",\n" +
            "  \"latitude\":\"29.02 \",\n" +
            "  \"longitude\":\"114.35 \",\n" +
            "  \"altitude\":\"147.40 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"修水县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"1\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57694\",\n" +
            "  \"latitude\":\"28.32 \",\n" +
            "  \"longitude\":\"114.23 \",\n" +
            "  \"altitude\":\"256.20 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"铜鼓县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"4\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57696\",\n" +
            "  \"latitude\":\"28.24 \",\n" +
            "  \"longitude\":\"114.47 \",\n" +
            "  \"altitude\":\"88.40 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"宜丰县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"4\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57698\",\n" +
            "  \"latitude\":\"28.06 \",\n" +
            "  \"longitude\":\"114.26 \",\n" +
            "  \"altitude\":\"99.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"万载县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"4\",\n" +
            "  \"info3\":\"4\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57699\",\n" +
            "  \"latitude\":\"28.14 \",\n" +
            "  \"longitude\":\"114.58 \",\n" +
            "  \"altitude\":\"66.60 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"上高县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"4\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57783\",\n" +
            "  \"latitude\":\"27.53 \",\n" +
            "  \"longitude\":\"113.49 \",\n" +
            "  \"altitude\":\"119.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"上栗县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"*\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57786\",\n" +
            "  \"latitude\":\"27.38 \",\n" +
            "  \"longitude\":\"113.51 \",\n" +
            "  \"altitude\":\"110.00 \",\n" +
            "  \"level\":\"5\",\n" +
            "  \"name\":\"萍乡市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"27\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57789\",\n" +
            "  \"latitude\":\"27.08 \",\n" +
            "  \"longitude\":\"113.57 \",\n" +
            "  \"altitude\":\"181.40 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"莲花县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"27\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57792\",\n" +
            "  \"latitude\":\"27.49 \",\n" +
            "  \"longitude\":\"114.41 \",\n" +
            "  \"altitude\":\"96.10 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"分宜县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"28\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57793\",\n" +
            "  \"latitude\":\"27.48 \",\n" +
            "  \"longitude\":\"114.23 \",\n" +
            "  \"altitude\":\"128.20 \",\n" +
            "  \"level\":\"5\",\n" +
            "  \"name\":\"宜春市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"6\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57794\",\n" +
            "  \"latitude\":\"27.38 \",\n" +
            "  \"longitude\":\"114.01 \",\n" +
            "  \"altitude\":\"177.20 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"芦溪县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"*\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57796\",\n" +
            "  \"latitude\":\"27.50 \",\n" +
            "  \"longitude\":\"114.53 \",\n" +
            "  \"altitude\":\"79.00 \",\n" +
            "  \"level\":\"5\",\n" +
            "  \"name\":\"新余市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"28\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57797\",\n" +
            "  \"latitude\":\"27.03 \",\n" +
            "  \"longitude\":\"114.55 \",\n" +
            "  \"altitude\":\"65.00 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"吉安县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"*\",\n" +
            "  \"info3\":\"4\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57798\",\n" +
            "  \"latitude\":\"27.24 \",\n" +
            "  \"longitude\":\"114.36 \",\n" +
            "  \"altitude\":\"85.70 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"安福县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"19\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57799\",\n" +
            "  \"latitude\":\"27.07 \",\n" +
            "  \"longitude\":\"114.58 \",\n" +
            "  \"altitude\":\"78.00 \",\n" +
            "  \"level\":\"5\",\n" +
            "  \"name\":\"吉安市\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"20\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57883\",\n" +
            "  \"latitude\":\"26.43 \",\n" +
            "  \"longitude\":\"113.58 \",\n" +
            "  \"altitude\":\"259.20 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"厦坪镇\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"21\",\n" +
            "  \"info3\":\"2\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57891\",\n" +
            "  \"latitude\":\"26.56 \",\n" +
            "  \"longitude\":\"114.15 \",\n" +
            "  \"altitude\":\"144.60 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"永新县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"19\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57894\",\n" +
            "  \"latitude\":\"26.35 \",\n" +
            "  \"longitude\":\"114.10 \",\n" +
            "  \"altitude\":\"838.10 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"井冈山市\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"21\",\n" +
            "  \"info3\":\"2\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57895\",\n" +
            "  \"latitude\":\"26.28 \",\n" +
            "  \"longitude\":\"114.47 \",\n" +
            "  \"altitude\":\"96.80 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"万安县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"21\",\n" +
            "  \"info3\":\"2\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57896\",\n" +
            "  \"latitude\":\"26.20 \",\n" +
            "  \"longitude\":\"114.30 \",\n" +
            "  \"altitude\":\"125.30 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"遂川县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"21\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57899\",\n" +
            "  \"latitude\":\"26.48 \",\n" +
            "  \"longitude\":\"114.55 \",\n" +
            "  \"altitude\":\"61.80 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"泰和县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"21\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57990\",\n" +
            "  \"latitude\":\"25.42 \",\n" +
            "  \"longitude\":\"114.19 \",\n" +
            "  \"altitude\":\"247.20 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"崇义县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"22\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57991\",\n" +
            "  \"latitude\":\"25.48 \",\n" +
            "  \"longitude\":\"114.33 \",\n" +
            "  \"altitude\":\"140.80 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"上犹县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"22\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57992\",\n" +
            "  \"latitude\":\"25.40 \",\n" +
            "  \"longitude\":\"114.45 \",\n" +
            "  \"altitude\":\"127.00 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"南康区\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"22\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57993\",\n" +
            "  \"latitude\":\"25.52 \",\n" +
            "  \"longitude\":\"115.00 \",\n" +
            "  \"altitude\":\"124.70 \",\n" +
            "  \"level\":\"5\",\n" +
            "  \"name\":\"赣州市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"22\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57994\",\n" +
            "  \"latitude\":\"25.24 \",\n" +
            "  \"longitude\":\"114.21 \",\n" +
            "  \"altitude\":\"213.70 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"大余县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"22\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"57995\",\n" +
            "  \"latitude\":\"25.24 \",\n" +
            "  \"longitude\":\"114.56 \",\n" +
            "  \"altitude\":\"163.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"信丰县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"22\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58502\",\n" +
            "  \"latitude\":\"29.40 \",\n" +
            "  \"longitude\":\"116.01 \",\n" +
            "  \"altitude\":\"37.10 \",\n" +
            "  \"level\":\"5\",\n" +
            "  \"name\":\"九江市\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"2\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58503\",\n" +
            "  \"latitude\":\"29.42 \",\n" +
            "  \"longitude\":\"115.40 \",\n" +
            "  \"altitude\":\"22.80 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"瑞昌市\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"2\",\n" +
            "  \"info3\":\"4\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58505\",\n" +
            "  \"latitude\":\"29.37 \",\n" +
            "  \"longitude\":\"115.54 \",\n" +
            "  \"altitude\":\"63.10 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"九江县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"*\",\n" +
            "  \"info3\":\"4\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58506\",\n" +
            "  \"latitude\":\"29.35 \",\n" +
            "  \"longitude\":\"115.59 \",\n" +
            "  \"altitude\":\"1165.00 \",\n" +
            "  \"level\":\"3\",\n" +
            "  \"name\":\"星子县\",\n" +
            "  \"info1\":\"6\",\n" +
            "  \"info2\":\"*\",\n" +
            "  \"info3\":\"2\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58507\",\n" +
            "  \"latitude\":\"29.15 \",\n" +
            "  \"longitude\":\"115.07 \",\n" +
            "  \"altitude\":\"76.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"武宁县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"1\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58508\",\n" +
            "  \"latitude\":\"29.20 \",\n" +
            "  \"longitude\":\"115.46 \",\n" +
            "  \"altitude\":\"42.90 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"德安县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"3\",\n" +
            "  \"info3\":\"4\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58509\",\n" +
            "  \"latitude\":\"29.03 \",\n" +
            "  \"longitude\":\"115.49 \",\n" +
            "  \"altitude\":\"36.80 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"永修县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"3\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58510\",\n" +
            "  \"latitude\":\"29.41 \",\n" +
            "  \"longitude\":\"116.12 \",\n" +
            "  \"altitude\":\"40.90 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"湖口县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"2\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58512\",\n" +
            "  \"latitude\":\"29.54 \",\n" +
            "  \"longitude\":\"116.33 \",\n" +
            "  \"altitude\":\"25.10 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"彭泽县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"2\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58514\",\n" +
            "  \"latitude\":\"29.27 \",\n" +
            "  \"longitude\":\"116.03 \",\n" +
            "  \"altitude\":\"35.60 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"庐山市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"3\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58517\",\n" +
            "  \"latitude\":\"29.15 \",\n" +
            "  \"longitude\":\"116.11 \",\n" +
            "  \"altitude\":\"35.90 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"都昌县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"3\",\n" +
            "  \"info3\":\"2\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58519\",\n" +
            "  \"latitude\":\"29.00 \",\n" +
            "  \"longitude\":\"116.41 \",\n" +
            "  \"altitude\":\"40.80 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"鄱阳县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"12\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58524\",\n" +
            "  \"latitude\":\"29.22 \",\n" +
            "  \"longitude\":\"117.13 \",\n" +
            "  \"altitude\":\"87.30 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"浮梁县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"*\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58527\",\n" +
            "  \"latitude\":\"29.18 \",\n" +
            "  \"longitude\":\"117.12 \",\n" +
            "  \"altitude\":\"62.90 \",\n" +
            "  \"level\":\"5\",\n" +
            "  \"name\":\"景德镇市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"10\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58529\",\n" +
            "  \"latitude\":\"29.17 \",\n" +
            "  \"longitude\":\"117.51 \",\n" +
            "  \"altitude\":\"82.00 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"婺源县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"13\",\n" +
            "  \"info3\":\"4\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58600\",\n" +
            "  \"latitude\":\"28.52 \",\n" +
            "  \"longitude\":\"115.22 \",\n" +
            "  \"altitude\":\"79.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"靖安县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"5\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58601\",\n" +
            "  \"latitude\":\"28.42 \",\n" +
            "  \"longitude\":\"115.23 \",\n" +
            "  \"altitude\":\"53.30 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"奉新县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"5\",\n" +
            "  \"info3\":\"4\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58602\",\n" +
            "  \"latitude\":\"28.51 \",\n" +
            "  \"longitude\":\"115.33 \",\n" +
            "  \"altitude\":\"38.90 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"安义县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"8\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58604\",\n" +
            "  \"latitude\":\"29.12 \",\n" +
            "  \"longitude\":\"115.49 \",\n" +
            "  \"altitude\":\"38.90 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"共青城市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"*\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58605\",\n" +
            "  \"latitude\":\"28.25 \",\n" +
            "  \"longitude\":\"115.23 \",\n" +
            "  \"altitude\":\"45.70 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"高安市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"5\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58606\",\n" +
            "  \"latitude\":\"28.36 \",\n" +
            "  \"longitude\":\"115.55 \",\n" +
            "  \"altitude\":\"45.70 \",\n" +
            "  \"level\":\"4\",\n" +
            "  \"name\":\"南昌市\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"8\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58607\",\n" +
            "  \"latitude\":\"28.33 \",\n" +
            "  \"longitude\":\"115.57 \",\n" +
            "  \"altitude\":\"28.70 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"南昌县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"9\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58608\",\n" +
            "  \"latitude\":\"28.04 \",\n" +
            "  \"longitude\":\"115.33 \",\n" +
            "  \"altitude\":\"30.40 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"樟树市\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"7\",\n" +
            "  \"info3\":\"4\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58609\",\n" +
            "  \"latitude\":\"28.13 \",\n" +
            "  \"longitude\":\"115.49 \",\n" +
            "  \"altitude\":\"26.90 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"丰城市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"7\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58612\",\n" +
            "  \"latitude\":\"28.42 \",\n" +
            "  \"longitude\":\"116.41 \",\n" +
            "  \"altitude\":\"22.00 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"余干县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"14\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58614\",\n" +
            "  \"latitude\":\"28.24 \",\n" +
            "  \"longitude\":\"116.17 \",\n" +
            "  \"altitude\":\"31.10 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"进贤县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"9\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58615\",\n" +
            "  \"latitude\":\"28.41 \",\n" +
            "  \"longitude\":\"117.05 \",\n" +
            "  \"altitude\":\"55.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"万年县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"14\",\n" +
            "  \"info3\":\"4\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58616\",\n" +
            "  \"latitude\":\"28.12 \",\n" +
            "  \"longitude\":\"116.49 \",\n" +
            "  \"altitude\":\"41.00 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"余江区\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"29\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58618\",\n" +
            "  \"latitude\":\"28.16 \",\n" +
            "  \"longitude\":\"116.36 \",\n" +
            "  \"altitude\":\"51.30 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"东乡区\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"16\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58619\",\n" +
            "  \"latitude\":\"28.00 \",\n" +
            "  \"longitude\":\"116.22 \",\n" +
            "  \"altitude\":\"47.30 \",\n" +
            "  \"level\":\"5\",\n" +
            "  \"name\":\"抚州市\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"16\",\n" +
            "  \"info3\":\"3\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58620\",\n" +
            "  \"latitude\":\"29.01 \",\n" +
            "  \"longitude\":\"117.06 \",\n" +
            "  \"altitude\":\"35.00 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"乐平市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"11\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58622\",\n" +
            "  \"latitude\":\"28.57 \",\n" +
            "  \"longitude\":\"117.35 \",\n" +
            "  \"altitude\":\"77.10 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"德兴市\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"13\",\n" +
            "  \"info3\":\"2\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58623\",\n" +
            "  \"latitude\":\"28.28 \",\n" +
            "  \"longitude\":\"117.55 \",\n" +
            "  \"altitude\":\"71.20 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"上饶县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"15\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58624\",\n" +
            "  \"latitude\":\"28.24 \",\n" +
            "  \"longitude\":\"117.26 \",\n" +
            "  \"altitude\":\"59.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"弋阳县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"15\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58625\",\n" +
            "  \"latitude\":\"28.25 \",\n" +
            "  \"longitude\":\"117.36 \",\n" +
            "  \"altitude\":\"79.20 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"横峰县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"15\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58626\",\n" +
            "  \"latitude\":\"28.19 \",\n" +
            "  \"longitude\":\"117.15 \",\n" +
            "  \"altitude\":\"51.70 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"贵溪市\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"29\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58627\",\n" +
            "  \"latitude\":\"28.19 \",\n" +
            "  \"longitude\":\"117.03 \",\n" +
            "  \"altitude\":\"54.60 \",\n" +
            "  \"level\":\"5\",\n" +
            "  \"name\":\"鹰潭市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"29\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58629\",\n" +
            "  \"latitude\":\"28.17 \",\n" +
            "  \"longitude\":\"117.42 \",\n" +
            "  \"altitude\":\"57.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"铅山县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"15\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58634\",\n" +
            "  \"latitude\":\"28.41 \",\n" +
            "  \"longitude\":\"118.15 \",\n" +
            "  \"altitude\":\"113.70 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"玉山县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"15\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58635\",\n" +
            "  \"latitude\":\"28.26 \",\n" +
            "  \"longitude\":\"118.12 \",\n" +
            "  \"altitude\":\"96.10 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"广丰区\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"15\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58637\",\n" +
            "  \"latitude\":\"28.27 \",\n" +
            "  \"longitude\":\"117.59 \",\n" +
            "  \"altitude\":\"114.90 \",\n" +
            "  \"level\":\"5\",\n" +
            "  \"name\":\"上饶市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"15\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58693\",\n" +
            "  \"latitude\":\"28.42 \",\n" +
            "  \"longitude\":\"115.50 \",\n" +
            "  \"altitude\":\"37.90 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"新建区\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"8\",\n" +
            "  \"info3\":\"4\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58701\",\n" +
            "  \"latitude\":\"27.46 \",\n" +
            "  \"longitude\":\"115.24 \",\n" +
            "  \"altitude\":\"44.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"新干县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"20\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58704\",\n" +
            "  \"latitude\":\"27.35 \",\n" +
            "  \"longitude\":\"115.21 \",\n" +
            "  \"altitude\":\"49.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"峡江县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"20\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58705\",\n" +
            "  \"latitude\":\"27.20 \",\n" +
            "  \"longitude\":\"115.25 \",\n" +
            "  \"altitude\":\"87.70 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"永丰县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"20\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58706\",\n" +
            "  \"latitude\":\"27.26 \",\n" +
            "  \"longitude\":\"115.50 \",\n" +
            "  \"altitude\":\"184.80 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"乐安县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"17\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58707\",\n" +
            "  \"latitude\":\"27.13 \",\n" +
            "  \"longitude\":\"115.08 \",\n" +
            "  \"altitude\":\"115.08 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"吉水县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"20\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58710\",\n" +
            "  \"latitude\":\"27.46 \",\n" +
            "  \"longitude\":\"116.03 \",\n" +
            "  \"altitude\":\"75.60 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"崇仁县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"17\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58712\",\n" +
            "  \"latitude\":\"27.55 \",\n" +
            "  \"longitude\":\"116.47 \",\n" +
            "  \"altitude\":\"128.80 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"金溪县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"16\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58713\",\n" +
            "  \"latitude\":\"27.43 \",\n" +
            "  \"longitude\":\"117.04 \",\n" +
            "  \"altitude\":\"220.60 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"资溪县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"18\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58714\",\n" +
            "  \"latitude\":\"27.33 \",\n" +
            "  \"longitude\":\"116.14 \",\n" +
            "  \"altitude\":\"88.30 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"宜黄县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"17\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58715\",\n" +
            "  \"latitude\":\"27.35 \",\n" +
            "  \"longitude\":\"116.39 \",\n" +
            "  \"altitude\":\"81.90 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"南城县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"18\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58718\",\n" +
            "  \"latitude\":\"27.13 \",\n" +
            "  \"longitude\":\"116.32 \",\n" +
            "  \"altitude\":\"106.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"南丰县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"18\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58719\",\n" +
            "  \"latitude\":\"27.18 \",\n" +
            "  \"longitude\":\"116.56 \",\n" +
            "  \"altitude\":\"130.60 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"黎川县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"18\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58804\",\n" +
            "  \"latitude\":\"26.21 \",\n" +
            "  \"longitude\":\"115.21 \",\n" +
            "  \"altitude\":\"148.80 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"兴国县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"24\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58806\",\n" +
            "  \"latitude\":\"26.29 \",\n" +
            "  \"longitude\":\"116.01 \",\n" +
            "  \"altitude\":\"210.10 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"宁都县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"24\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58813\",\n" +
            "  \"latitude\":\"26.50 \",\n" +
            "  \"longitude\":\"116.18 \",\n" +
            "  \"altitude\":\"141.60 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"广昌县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"18\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58814\",\n" +
            "  \"latitude\":\"26.21 \",\n" +
            "  \"longitude\":\"116.21 \",\n" +
            "  \"altitude\":\"230.70 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"石城县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"24\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58900\",\n" +
            "  \"latitude\":\"25.58 \",\n" +
            "  \"longitude\":\"115.00 \",\n" +
            "  \"altitude\":\"126.70 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"赣县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"*\",\n" +
            "  \"info3\":\"1\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58903\",\n" +
            "  \"latitude\":\"25.54 \",\n" +
            "  \"longitude\":\"116.02 \",\n" +
            "  \"altitude\":\"194.10 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"瑞金市\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"25\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58905\",\n" +
            "  \"latitude\":\"25.58 \",\n" +
            "  \"longitude\":\"115.25 \",\n" +
            "  \"altitude\":\"132.60 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"于都县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"25\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58906\",\n" +
            "  \"latitude\":\"25.36 \",\n" +
            "  \"longitude\":\"115.48 \",\n" +
            "  \"altitude\":\"167.90 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"会昌县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"25\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"58907\",\n" +
            "  \"latitude\":\"25.09 \",\n" +
            "  \"longitude\":\"115.24 \",\n" +
            "  \"altitude\":\"288.30 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"安远县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"26\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"59091\",\n" +
            "  \"latitude\":\"24.45 \",\n" +
            "  \"longitude\":\"114.31 \",\n" +
            "  \"altitude\":\"253.40 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"全南县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"23\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"59092\",\n" +
            "  \"latitude\":\"24.55 \",\n" +
            "  \"longitude\":\"114.49 \",\n" +
            "  \"altitude\":\"206.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"龙南县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"23\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"59093\",\n" +
            "  \"latitude\":\"24.47 \",\n" +
            "  \"longitude\":\"115.02 \",\n" +
            "  \"altitude\":\"251.50 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"定南县\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"23\",\n" +
            "  \"info3\":\"2\"\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"59102\",\n" +
            "  \"latitude\":\"24.57 \",\n" +
            "  \"longitude\":\"115.39 \",\n" +
            "  \"altitude\":\"302.70 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"寻乌县\",\n" +
            "  \"info1\":\"2\",\n" +
            "  \"info2\":\"26\",\n" +
            "  \"info3\":null\n" +
            "  },\n" +
            "  {\n" +
            "  \"id\":\"J4020\",\n" +
            "  \"latitude\":\"28.03 \",\n" +
            "  \"longitude\":\"117.02 \",\n" +
            "  \"altitude\":\"500.00 \",\n" +
            "  \"level\":\"6\",\n" +
            "  \"name\":\"龙虎山\",\n" +
            "  \"info1\":\"3\",\n" +
            "  \"info2\":\"*\",\n" +
            "  \"info3\":\"2\"\n" +
            "  }\n" +
            "  ]\n";

    public static Double[] getInfo(String citySelect) {
//        String substring = citySelect.substring(0, 3);
        Double[] ret = new Double[2];
        JsonArray jsonArray = new JsonParser().parse(info).getAsJsonArray();
        for (int i = 0; i < jsonArray.size(); i++) {
            JsonObject jsonObject = (JsonObject) jsonArray.get(i);
            String name = jsonObject.get("name").getAsString();
            if (name.equals(citySelect)) {
                String longitude = jsonObject.get("longitude").getAsString();
                Double aDouble = Double.valueOf(longitude);
                String latitude = jsonObject.get("latitude").getAsString();
                Double aDouble1 = Double.valueOf(latitude);
                ret[0] = aDouble;
                ret[1] = aDouble1;
                break;
            }
        }
        return ret;
    }


    public static String getTitle(String acode) {
        String ret = "";
        JsonArray jsonArray = new JsonParser().parse(info).getAsJsonArray();
        for (int i = 0; i < jsonArray.size(); i++) {
            JsonObject jsonObject = (JsonObject) jsonArray.get(i);
            String id = jsonObject.get("id").getAsString();
            if (id.equals(acode)) {
                ret = jsonObject.get("name").getAsString();
                break;
            }
        }
        return ret;
    }


    public static Double[] getInfoBycode(String acode) {
//        String substring = citySelect.substring(0, 3);
        Double[] ret = new Double[2];
        JsonArray jsonArray = new JsonParser().parse(info).getAsJsonArray();
        for (int i = 0; i < jsonArray.size(); i++) {
            JsonObject jsonObject = (JsonObject) jsonArray.get(i);
            String id = jsonObject.get("id").getAsString();
            if (id.equals(acode)) {
                String longitude = jsonObject.get("longitude").getAsString();
                Double aDouble = Double.valueOf(longitude);
                String latitude = jsonObject.get("latitude").getAsString();
                Double aDouble1 = Double.valueOf(latitude);
                ret[0] = aDouble;
                ret[1] = aDouble1;
                break;
            }
        }
        return ret;
    }


    public static String getPicName(String name) {
        String ret = "";
        String josnStr = " [\n" +
                "    {\"name\":\"持续高温蓝色\",\"image\":\"swarning_conten_coldspell_blue\"},\n" +
                "    {\"name\":\"持续高温黄色\",\"image\":\"swarning_conten_coldspell_yellow\"},\n" +
                "    {\"name\":\"寒潮蓝色\",\"image\":\"swarning_conten_coldwave_blue\"},\n" +
                "    {\"name\":\"寒潮橙色\",\"image\":\"swarning_conten_coldwave_orange\"},\n" +
                "    {\"name\":\"寒潮红色\",\"image\":\"swarning_conten_coldwave_red\"},\n" +
                "    {\"name\":\"寒潮黄色\",\"image\":\"swarning_conten_coldwave_yellow\"},\n" +
                "    {\"name\":\"干旱橙色\",\"image\":\"swarning_conten_drought_orange\"},\n" +
                "    {\"name\":\"干旱红色\",\"image\":\"swarning_conten_drought_red\"},\n" +
                "    {\"name\":\"沙尘蓝色\",\"image\":\"swarning_conten_dust_blue\"},\n" +
                "    {\"name\":\"霜冻蓝色\",\"image\":\"swarning_conten_frost_blue\"},\n" +
                "    {\"name\":\"霜冻橙色\",\"image\":\"swarning_conten_frost_orange\"},\n" +
                "    {\"name\":\"霜冻黄色\",\"image\":\"swarning_conten_frost_yellow\"},\n" +
                "    {\"name\":\"大风蓝色\",\"image\":\"swarning_conten_gale_blue\"},\n" +
                "    {\"name\":\"大风橙色\",\"image\":\"swarning_conten_gale_orange\"},\n" +
                "    {\"name\":\"大风红色\",\"image\":\"swarning_conten_gale_red\"},\n" +
                "    {\"name\":\"大风黄色\",\"image\":\"swarning_conten_gale_yellow\"},\n" +
                "    {\"name\":\"冰雹橙色\",\"image\":\"swarning_conten_hail_orange\"},\n" +
                "    {\"name\":\"冰雹红色\",\"image\":\"swarning_conten_hail_red\"},\n" +
                "    {\"name\":\"冰雹黄色\",\"image\":\"swarning_conten_hail_yellow\"},\n" +
                "    {\"name\":\"霾橙色\",\"image\":\"swarning_conten_haze_orange\"},\n" +
                "    {\"name\":\"霾红色\",\"image\":\"swarning_conten_haze_red\"},\n" +
                "    {\"name\":\"霾黄色\",\"image\":\"swarning_conten_haze_yellow\"},\n" +
                "    {\"name\":\"高温蓝色\",\"image\":\"swarning_conten_heatwave_blue\"},\n" +
                "    {\"name\":\"高温橙色\",\"image\":\"swarning_conten_heatwave_orange\"},\n" +
                "    {\"name\":\"高温红色\",\"image\":\"swarning_conten_heatwave_red\"},\n" +
                "    {\"name\":\"高温黄色\",\"image\":\"swarning_conten_heatwave_yellow\"},\n" +
                "    {\"name\":\"大雾橙色\",\"image\":\"swarning_conten_heavyfog_orange\"},\n" +
                "    {\"name\":\"大雾红色\",\"image\":\"swarning_conten_heavyfog_red\"},\n" +
                "    {\"name\":\"大雾黄色\",\"image\":\"swarning_conten_heavyfog_yellow\"},\n" +
                "    {\"name\":\"雷电蓝色\",\"image\":\"swarning_conten_lightning_blue\"},\n" +
                "    {\"name\":\"雷电橙色\",\"image\":\"swarning_conten_lightning_orange\"},\n" +
                "    {\"name\":\"雷电红色\",\"image\":\"swarning_conten_lightning_red\"},\n" +
                "    {\"name\":\"雷电黄色\",\"image\":\"swarning_conten_lightning_yellow\"},\n" +
                "    {\"name\":\"暴雨蓝色\",\"image\":\"swarning_conten_rainstorm_blue\"},\n" +
                "    {\"name\":\"暴雨橙色\",\"image\":\"swarning_conten_rainstorm_orange\"},\n" +
                "    {\"name\":\"暴雨红色\",\"image\":\"swarning_conten_rainstorm_red\"},\n" +
                "    {\"name\":\"暴雨黄色\",\"image\":\"swarning_conten_rainstorm_yellow\"},\n" +
                "    {\"name\":\"道路结冰橙色\",\"image\":\"swarning_conten_roadicing_orange\"},\n" +
                "    {\"name\":\"道路结冰红色\",\"image\":\"swarning_conten_roadicing_red\"},\n" +
                "    {\"name\":\"道路结冰黄色\",\"image\":\"swarning_conten_roadicing_yellow\"},\n" +
                "    {\"name\":\"沙尘暴橙色\",\"image\":\"swarning_conten_sandstorm_orange\"},\n" +
                "    {\"name\":\"沙尘暴红色\",\"image\":\"swarning_conten_sandstorm_red\"},\n" +
                "    {\"name\":\"沙尘暴黄色\",\"image\":\"swarning_conten_sandstorm_yellow\"},\n" +
                "    {\"name\":\"暴雪蓝色\",\"image\":\"swarning_conten_snowstorm_blue\"},\n" +
                "    {\"name\":\"暴雪橙色\",\"image\":\"swarning_conten_snowstorm_orange\"},\n" +
                "    {\"name\":\"暴雪红色\",\"image\":\"swarning_conten_snowstorm_red\"},\n" +
                "    {\"name\":\"暴雪黄色\",\"image\":\"swarning_conten_snowstorm_yellow\"},\n" +
                "    {\"name\":\"雷雨大风蓝色\",\"image\":\"swarning_conten_thundergust_blue\"},\n" +
                "    {\"name\":\"雷雨大风橙色\",\"image\":\"swarning_conten_thundergust_orange\"},\n" +
                "    {\"name\":\"雷雨大风红色\",\"image\":\"swarning_conten_thundergust_red\"},\n" +
                "    {\"name\":\"雷雨大风黄色\",\"image\":\"swarning_conten_thundergust_yellow\"},\n" +
                "    {\"name\":\"台风蓝色\",\"image\":\"swarning_conten_typhoon_blue\"},\n" +
                "    {\"name\":\"台风橙色\",\"image\":\"swarning_conten_typhoon_orange\"},\n" +
                "    {\"name\":\"台风红色\",\"image\":\"swarning_conten_typhoon_red\"},\n" +
                "    {\"name\":\"台风黄色\",\"image\":\"swarning_conten_typhoon_yellow\"},\n" +
                "    {\"name\":\"台风白色\",\"image\":\"swarning_conten_typhoon_white\"},\n" +
                "    {\"name\":\"森林火险蓝色\",\"image\":\"swarning_conten_wildfire_blue\"},\n" +
                "    {\"name\":\"森林火险橙色\",\"image\":\"swarning_conten_wildfire_orange\"},\n" +
                "    {\"name\":\"森林火险红色\",\"image\":\"swarning_conten_wildfire_red\"},\n" +
                "    {\"name\":\"森林火险黄色\",\"image\":\"swarning_conten_wildfire_yellow\"}\n" +
                "]\n";
        JsonArray jsonArray = new JsonParser().parse(josnStr).getAsJsonArray();
        for (int i = 0; i < jsonArray.size(); i++) {
            JsonElement element = jsonArray.get(i);
            JsonObject asJsonObject = element.getAsJsonObject();
            String name1 = asJsonObject.get("name").getAsString();
            if (name1.equals(name)) {
                ret = asJsonObject.get("image").getAsString();
            }
        }
        return ret;
    }

//    public static String getPicName(String name) {
//        String josnStr = "{\n" +
//                "\t\"暴雪橙色\":\"orange_snowstorm\",\n" +
//                "\t\"暴雨橙色\":\"orange_rainstorm\",\n" +
//                "\t\"冰雹橙色\":\"orange_hailstone\",\n" +
//                "\t\"大风橙色\":\"orange_gale\",\n" +
//                "\t\"大雾橙色\":\"orange_heavy_fog\",\n" +
//                "\t\"道路结冰橙色\":\"orange_icy_road\",\n" +
//                "\t\"干旱橙色\":\"orange_dry\",\n" +
//                "\t\"高温橙色\":\"orange_high_temperature\",\n" +
//                "\t\"寒潮橙色\":\"orange_code_wave\",\n" +
//                "\t\"雷电橙色\":\"orange_thunder\",\n" +
//                "\t\"霾橙色\":\"orange_haze\",\n" +
//                "\t\"霜冻橙色\":\"orange_frost\",\n" +
//                "\t\"台风橙色\":\"orange_typhoon\",\n" +
//                "\n" +
//                "\n" +
//                "\t\"暴雪红色\":\"red_snowstorm\",\n" +
//                "\t\"暴雨红色\":\"red_rainstorm\",\n" +
//                "\t\"冰雹红色\":\"red_hailstone\",\n" +
//                "\t\"大风红色\":\"red_gale\",\n" +
//                "\t\"大雾红色\":\"red_heavy_fog\",\n" +
//                "\t\"道路结冰红色\":\"red_icy_road\",\n" +
//                "\t\"干旱红色\":\"red_dry\",\n" +
//                "\t\"高温红色\":\"red_high_temperature\",\n" +
//                "\t\"寒潮红色\":\"red_code_wave\",\n" +
//                "\t\"雷电红色\":\"red_thunder\",\n" +
//                "\t\"霾红色\":\"red_haze\",\n" +
//                "\t\"台风红色\":\"red_typhoon\",\n" +
//                "\n" +
//                "\n" +
//                "\t\"暴雪黄色\":\"yellow_snowstorm\",\n" +
//                "\t\"暴雨黄色\":\"yellow_rainstorm\",\n" +
//                "\t\"大风黄色\":\"yellow_gale\",\n" +
//                "\t\"大雾黄色\":\"yellow_heavy_fog\",\n" +
//                "\t\"道路结冰黄色\":\"yellow_icy_road\",\n" +
//                "\t\"高温黄色\":\"yellow_high_temperature\",\n" +
//                "\t\"寒潮黄色\":\"yellow_code_wave\",\n" +
//                "\t\"雷电黄色\":\"yellow_thunder\",\n" +
//                "\t\"霾黄色\":\"yellow_haze\",\n" +
//                "\t\"霜冻黄色\":\"yellow_frost\",\n" +
//                "\t\"台风黄色\":\"yellow_typhoon\",\n" +
//                "\t\n" +
//                "\n" +
//                "\n" +
//                " \t\"暴雪蓝色\":\"bule_snowstorm\",\n" +
//                "\t\"暴雨蓝色\":\"bule_rainstorm\",\n" +
//                "\t\"大风蓝色\":\"bule_gale\",\n" +
//                "\t\"寒潮蓝色\":\"bule_code_wave\",\n" +
//                "\t\"霜冻蓝色\":\"bule_frost\",\n" +
//                "\t\"台风蓝色\":\"bule_typhoon\"\n" +
//                "\n" +
//                "\n" +
//                "\t\n" +
//                "}";
//        JsonObject jsonObject = new JsonParser().parse(josnStr).getAsJsonObject();
//        String ret = jsonObject.get(name).getAsString();
//        return ret;
//    }

//    public static String getPicName(String name) {
//        String josnStr = " [\n" +
//                "  {\"name\":\"蓝色持续高温\",\"image\":\"warning_conten_coldspell_blue\"},\n" +
//                "  {\"name\":\"黄色持续高温\",\"image\":\"warning_conten_coldspell_yellow\"},\n" +
//                "  {\"name\":\"蓝色寒潮\",\"image\":\"warning_conten_coldwave_blue\"},\n" +
//                "  {\"name\":\"橙色寒潮\",\"image\":\"warning_conten_coldwave_orange\"},\n" +
//                "  {\"name\":\"红色寒潮\",\"image\":\"warning_conten_coldwave_red\"},\n" +
//                "  {\"name\":\"黄色寒潮\",\"image\":\"warning_conten_coldwave_yellow\"},\n" +
//                "  {\"name\":\"橙色干旱\",\"image\":\"warning_conten_drought_orange\"},\n" +
//                "  {\"name\":\"红色干旱\",\"image\":\"warning_conten_drought_red\"},\n" +
//                "  {\"name\":\"蓝色沙尘\",\"image\":\"warning_conten_dust_blue\"},\n" +
//                "  {\"name\":\"蓝色霜冻\",\"image\":\"warning_conten_frost_blue\"},\n" +
//                "  {\"name\":\"橙色霜冻\",\"image\":\"warning_conten_frost_orange\"},\n" +
//                "  {\"name\":\"黄色霜冻\",\"image\":\"warning_conten_frost_yellow\"},\n" +
//                "  {\"name\":\"蓝色大风\",\"image\":\"warning_conten_gale_blue\"},\n" +
//                "  {\"name\":\"橙色大风\",\"image\":\"warning_conten_gale_orange\"},\n" +
//                "  {\"name\":\"红色大风\",\"image\":\"warning_conten_gale_red\"},\n" +
//                "  {\"name\":\"黄色大风\",\"image\":\"warning_conten_gale_yellow\"},\n" +
//                "  {\"name\":\"橙色冰雹\",\"image\":\"warning_conten_hail_orange\"},\n" +
//                "  {\"name\":\"红色冰雹\",\"image\":\"warning_conten_hail_red\"},\n" +
//                "  {\"name\":\"黄色冰雹\",\"image\":\"warning_conten_hail_yellow\"},\n" +
//                "  {\"name\":\"橙色霾\",\"image\":\"warning_conten_haze_orange\"},\n" +
//                "  {\"name\":\"红色霾\",\"image\":\"warning_conten_haze_red\"},\n" +
//                "  {\"name\":\"黄色霾\",\"image\":\"warning_conten_haze_yellow\"},\n" +
//                "  {\"name\":\"蓝色高温\",\"image\":\"warning_conten_heatwave_blue\"},\n" +
//                "  {\"name\":\"橙色高温\",\"image\":\"warning_conten_heatwave_orange\"},\n" +
//                "  {\"name\":\"红色高温\",\"image\":\"warning_conten_heatwave_red\"},\n" +
//                "  {\"name\":\"黄色高温\",\"image\":\"warning_conten_heatwave_yellow\"},\n" +
//                "  {\"name\":\"橙色大雾\",\"image\":\"warning_conten_heavyfog_orange\"},\n" +
//                "  {\"name\":\"红色大雾\",\"image\":\"warning_conten_heavyfog_red\"},\n" +
//                "  {\"name\":\"黄色大雾\",\"image\":\"warning_conten_heavyfog_yellow\"},\n" +
//                "  {\"name\":\"蓝色雷电\",\"image\":\"warning_conten_lightning_blue\"},\n" +
//                "  {\"name\":\"橙色雷电\",\"image\":\"warning_conten_lightning_orange\"},\n" +
//                "  {\"name\":\"红色雷电\",\"image\":\"warning_conten_lightning_red\"},\n" +
//                "  {\"name\":\"黄色雷电\",\"image\":\"warning_conten_lightning_yellow\"},\n" +
//                "  {\"name\":\"蓝色暴雨\",\"image\":\"warning_conten_rainstorm_blue\"},\n" +
//                "  {\"name\":\"橙色暴雨\",\"image\":\"warning_conten_rainstorm_orange\"},\n" +
//                "  {\"name\":\"红色暴雨\",\"image\":\"warning_conten_rainstorm_red\"},\n" +
//                "  {\"name\":\"黄色暴雨\",\"image\":\"warning_conten_rainstorm_yellow\"},\n" +
//                "  {\"name\":\"橙色道路结冰\",\"image\":\"warning_conten_roadicing_orange\"},\n" +
//                "  {\"name\":\"红色道路结冰\",\"image\":\"warning_conten_roadicing_red\"},\n" +
//                "  {\"name\":\"黄色道路结冰\",\"image\":\"warning_conten_roadicing_yellow\"},\n" +
//                "  {\"name\":\"橙色沙尘暴\",\"image\":\"warning_conten_sandstorm_orange\"},\n" +
//                "  {\"name\":\"红色沙尘暴\",\"image\":\"warning_conten_sandstorm_red\"},\n" +
//                "  {\"name\":\"黄色沙尘暴\",\"image\":\"warning_conten_sandstorm_yellow\"},\n" +
//                "  {\"name\":\"蓝色暴雪\",\"image\":\"warning_conten_snowstorm_blue\"},\n" +
//                "  {\"name\":\"橙色暴雪\",\"image\":\"warning_conten_snowstorm_orange\"},\n" +
//                "  {\"name\":\"红色暴雪\",\"image\":\"warning_conten_snowstorm_red\"},\n" +
//                "  {\"name\":\"黄色暴雪\",\"image\":\"warning_conten_snowstorm_yellow\"},\n" +
//                "  {\"name\":\"蓝色雷雨大风\",\"image\":\"warning_conten_thundergust_blue\"},\n" +
//                "  {\"name\":\"橙色雷雨大风\",\"image\":\"warning_conten_thundergust_orange\"},\n" +
//                "  {\"name\":\"红色雷雨大风\",\"image\":\"warning_conten_thundergust_red\"},\n" +
//                "  {\"name\":\"黄色雷雨大风\",\"image\":\"warning_conten_thundergust_yellow\"},\n" +
//                "  {\"name\":\"蓝色台风\",\"image\":\"warning_conten_typhoon_blue\"},\n" +
//                "  {\"name\":\"橙色台风\",\"image\":\"warning_conten_typhoon_orange\"},\n" +
//                "  {\"name\":\"红色台风\",\"image\":\"warning_conten_typhoon_red\"},\n" +
//                "  {\"name\":\"黄色台风\",\"image\":\"warning_conten_typhoon_yellow\"},\n" +
//                "  {\"name\":\"白色台风\",\"image\":\"warning_conten_typhoon_white\"},\n" +
//                "  {\"name\":\"蓝色森林火险\",\"image\":\"warning_conten_wildfire_blue\"},\n" +
//                "  {\"name\":\"橙色森林火险\",\"image\":\"warning_conten_wildfire_orange\"},\n" +
//                "  {\"name\":\"红色森林火险\",\"image\":\"warning_conten_wildfire_red\"},\n" +
//                "  {\"name\":\"黄色森林火险\",\"image\":\"warning_conten_wildfire_yellow\"}\n" +
//                "  ]\n";
//        JsonArray jsonArray = new JsonParser().parse(josnStr).getAsJsonArray();
//        for (JsonElement element:jsonArray
//             ) {
//            JsonObject asJsonObject = element.getAsJsonObject();
//            String asString = asJsonObject.get("name").getAsString();
//            if(name.equals(asString)){
//                String image = asJsonObject.get("image").getAsString();
//                return  image;
//            }
//        }
//        return  "";
//        String ret = jsonObject.get(name).getAsString();
//        return ret;
//    }
}
